app/controllers/allow_tests_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    #Todos os usuários e suas autorizações
    @users = User.find(:all)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `allow_tests` WHERE (`allow_tests`.user_id = 2)
SELECT * FROM `test_tabs`
---
  def show
    #Todas as autorizações de um usuário
    @user = User.find(params[:user_id])
    @allow_tests = @user.allow_tests.find(:all)
    @test_tabs = TestTab.all

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def new
    @user = User.find(params[:user_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `allow_tests` (`updated_at`, `authorization`, `test_tab_id`, `user_id`, `created_at`) VALUES('2010-01-06 23:38:52', 1, 1, 2, '2010-01-06 23:38:52')
---
  def create
    @user = User.find(params[:user_id])
    @allow_test = @user.allow_tests.new(params[:allow_test])
    respond_to do |format|
      if @allow_test.save

SELECT * FROM `allow_tests` WHERE (`allow_tests`.`id` = 1)
DELETE FROM `allow_tests` WHERE `id` = 1
---
  def destroy
    @allow_test = AllowTest.find(params[:id])
    @allow_test.destroy