app/controllers/areas_controller.rb

  def index

    @areas = Area.paginate :per_page => 5, :page => params[:page], :order => 'name'
---
SELECT * FROM `areas` ORDER BY name LIMIT 0, 5
SELECT count(*) AS count_all FROM `areas`

  def show
    @area = Area.find(params[:id])
---
SELECT * FROM `areas` WHERE (`areas`.`id` = 1)

  def create
    @area = Area.new(params[:area])

    respond_to do |format|
      if @area.save
---
INSERT INTO `areas` (`name`, `updated_at`, `description`, `created_at`) VALUES('Vendas - Gerente', '2010-03-03 23:39:17', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed viverra mattis facilisis.', '2010-03-03 23:39:17')