app/controllers/curriculos_controller.rb

  def edit
   @curriculo = Curriculo.find(params[:id])
---
SELECT * FROM `curriculos` WHERE (`curriculos`.user_id = 2) LIMIT 1