app/controllers/curriculos_controller.rb

SELECT * FROM `curriculos` WHERE (`curriculos`.user_id = 2) LIMIT 1
SELECT * FROM `areas` WHERE (`areas`.`id` = 5)
SELECT * FROM `areas`
SELECT * FROM `escolaridades` WHERE (`escolaridades`.curriculo_id = 1)
SELECT * FROM `exps` WHERE (`exps`.curriculo_id = 1)
---
  def print
    @curriculo = Curriculo.find(params[:curriculo_id])
    @area1 = Area.find(@curriculo.area_id1)
    @area2 = Area.find(@curriculo.area_id2)
    @area3 = Area.find(@curriculo.area_id3)
    @escolaridades = @curriculo.escolaridades.all
    @exps = @curriculo.exps.all

SELECT * FROM `curriculos` WHERE (`curriculos`.user_id = 8) LIMIT 1
SELECT * FROM `areas` WHERE (`areas`.`id` = 5)
SELECT * FROM `areas`
SELECT * FROM `escolaridades` WHERE (`escolaridades`.curriculo_id = 1)
SELECT * FROM `exps` WHERE (`exps`.curriculo_id = 1)
---
  def show
    if (params[:id].blank?)
      @curriculo = @user.curriculo
    else
      @curriculo = Curriculo.find(params[:id])
    end
    @area1 = Area.find(@curriculo.area_id1)
    @area2 = Area.find(@curriculo.area_id2)
    @area3 = Area.find(@curriculo.area_id3)
    @escolaridades = @curriculo.escolaridades.all
    @exps = @curriculo.exps.all

INSERT INTO `curriculos` (`celular`, `updated_at`, `data_nasc`, `endereco`, `spanish`, `nome`, `empregado`, `escolaridade`, `informatica`, `area_id1`, `english`, `area_id2`, `area_id3`, `sobrenome`, `filhos`, `estado_civil`, `cidade`, `user_id`, `complemento`, `bairro`, `numero`, `estado`, `telefone`, `salario`, `created_at`) VALUES('16 8128-1502', '2010-03-04 04:19:00', '1988-04-19 00:00:00', 'Av. Francisco Pereira Lopes', 'Básico', 'Isaac', 0, 4, 'Avançado', 5, 'Avançado', 6, 1, 'Queiroz', 0, 'Solteiro(a)', 'São Carlos', 2, 'Apto. 21 E', 'Pq. Santa Mônica', 2020, 'São Paulo', '', 2500, '2010-03-04 04:19:00')
UPDATE `curriculos` SET `user_id` = NULL, `updated_at` = '2010-02-19 04:37:12' WHERE `id` = 1
---
  def create
    @curriculo = @user.create_curriculo(params[:curriculo])

    respond_to do |format|
      if @curriculo.save