app/controllers/noticias_controller.rb

  def show
    @noticia = Noticia.find(params[:id])
---
SELECT * FROM `noticias` WHERE (`noticias`.`id` = 1)

  def create
    @noticia = Noticia.new(params[:noticia])

    respond_to do |format|
      if @noticia.save
---
INSERT INTO `noticias` (`created_at`, `title`, `body`, `updated_at`) VALUES('2010-07-15 21:01:24', 'Teste', 'Testando', '2010-07-15 21:01:24')