app/controllers/question_tabs_controller.rb

  def index
    @question_tabs = @test_tab.question_tabs.all
---
SELECT * FROM `question_tabs` WHERE (`question_tabs`.test_tab_id = 1)

  def show
    @question_tab = @test_tab.question_tabs.find(params[:id])
---
SELECT * FROM `question_tabs` WHERE (`question_tabs`.`id` = 1 AND (`question_tabs`.test_tab_id = 1))
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)

  def edit
    @question_tab = @test_tab.question_tabs.find(params[:id])
---
SELECT * FROM `question_tabs` WHERE (`question_tabs`.`id` = 2 AND (`question_tabs`.test_tab_id = 1))
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)

  def create
    @question_tab = @test_tab.question_tabs.new(params[:question_tab])

    respond_to do |format|
      if @question_tab.save
---
INSERT INTO `question_tabs` (`updated_at`, `texto`, `titulo`, `picture_content_type`, `picture_file_name`, `picture_updated_at`, `test_tab_id`, `picture_file_size`, `created_at`) VALUES('2009-12-28 04:55:26', 'Lorem ipsum dolor sit amet, felis commodo tincidunt, felis nibh amet, dignissim eu.', 'Questão 1', 'image/jpeg', 'funny-dog-pictures-take-pill.jpg', '2009-12-28 04:55:26', 1, 43237, '2009-12-28 04:55:26')

  def update
    @question_tab = @test_tab.question_tabs.find(params[:id])
---
SELECT * FROM `question_tabs` WHERE (`question_tabs`.`id` = 2 AND (`question_tabs`.test_tab_id = 1))
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)

  def destroy
    @question_tab = @test_tab.question_tabs.find(params[:id])
    @question_tab.destroy
---
SELECT * FROM `question_tabs` WHERE (`question_tabs`.`id` = 1 AND (`question_tabs`.test_tab_id = 1))
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)
DELETE FROM `question_tabs` WHERE `id` = 1