app/controllers/questions_controller.rb

SELECT * FROM `questions` WHERE (`questions`.test_id = 1)
---
  def index
    @questions = @test.questions.find(:all)

SELECT * FROM `questions` WHERE (`questions`.`id` = 1 AND (`questions`.test_id = 1))
---
  def show
    @questions = @test.questions.find(:all)

INSERT INTO `questions` (`imagem`, `resposta`, `test_id`, `updated_at`, `texto`, `titulo`, `created_at`) VALUES('', NULL, 1, '2009-12-16 05:47:50', 'Quanto é 1+1?', 'Questão 1', '2009-12-16 05:47:50')
---
  def create
    @question = @test.questions.new(params[:question])
    @question.question_tab_id = @question_tabs[@q_number].id
    respond_to do |format|
      if @question.save