app/controllers/results_controller.rb

  def test_selection
    #O admin seleciona o teste
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def test_results
    #Mostra os resultados de um user em um test.
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1