app/controllers/searches_controller.rb

INSERT INTO `searches` (`area_atuacao`, `espanhol`, `created_at`, `ingles`, `nome`, `updated_at`, `empregado`, `informatica`, `escolaridade`, `cidade`, `estado`) VALUES(NULL, '', '2010-06-10 18:00:29', '', 'Isaac', '2010-06-10 18:00:29', '', '', NULL, '', '')
---
  def create
    @search = Search.new(params[:search])
    @search.save

SELECT * FROM `searches` WHERE (`searches`.`id` = 1)
SELECT * FROM `curriculos` WHERE (curriculos.spanish LIKE '%Intermediário%' AND curriculos.informatica LIKE '%Intermediário%')
---
  def show
    @search = Search.find(params[:id])

    @curriculos = @search.curriculos.paginate :per_page => 5, :page => params[:page], :order => 'nome'