app/controllers/tests_controller.rb

  def show
    @test = @user.tests.find(params[:id])
    @test_tab = TestTab.find(@test.test_tab_id)
---
SELECT * FROM `tests` WHERE (`tests`.`id` = 6 AND (`tests`.user_id = 1))
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)

  def create
    @test = @user.tests.new(params[:test])

    respond_to do |format|
      if @test.save
---
INSERT INTO `tests` (`updated_at`, `nome`, `descricao`, `created_at`) VALUES('2009-12-16 05:40:02', 'Teste 1', 'Esse é um teste', '2009-12-16 05:40:02')

  def destroy
    @test = Test.find(params[:id])
    @test.destroy
---
SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
DELETE FROM `tests` WHERE `id` = 1