app/controllers/test_tabs_controller.rb

  def index
    @test_tabs = TestTab.all
---
SELECT * FROM `test_tabs`

  def show
    @test_tab = TestTab.find(params[:id])
---
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)

  def edit
    @test_tab = TestTab.find(params[:id])
---
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)

  def create
    @test_tab = TestTab.new(params[:test_tab])

    respond_to do |format|
      if @test_tab.save
---
INSERT INTO `test_tabs` (`updated_at`, `nome`, `descricao`, `created_at`) VALUES('2009-12-16 19:01:52', 'Raven', 'Isso é um teste.', '2009-12-16 19:01:52')

  def update
    @test_tab = TestTab.find(params[:id])
---
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)

  def destroy
    @test_tab = TestTab.find(params[:id])
    @test_tab.destroy
---
SELECT * FROM `test_tabs` WHERE (`test_tabs`.`id` = 1)
DELETE FROM `test_tabs` WHERE `id` = 1