app/controllers/users_controller.rb

	def create
		cookies.delete :auth_token
		@user = User.new(params[:user])
		if verify_recaptcha(:message => "Você digitou o texto errado. Tente novamente")
      @user.save!
---
INSERT INTO `users` (`salt`, `name`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `password_reset_code`, `activation_code`, `enabled`, `remember_token`, `curriculo_id`, `login`, `surname`, `email`) VALUES('5dee936edd38db8cf336bf07138703970571fc5f', NULL, '2010-05-25 21:33:22', NULL, 'a165673d47d4f1bdb4fcc5a4e56ff2f80901dfe1', NULL, '2010-05-25 21:33:22', NULL, '66adc5b4c6bfd9ec591da3e7c2b7253204a4b290', 1, NULL, NULL, 'Treco', NULL, 'treco@gmail.com')

	def update
		@user = User.find(current_user)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1